define clueList = [ # clue content, index = line number - 2
    ("调查报告（片段）", "有关温心的调查报告。\n与怪异产生联系后，城安局特调组重新对温心的死亡事件进行了调查。"),
    ("客厅-餐桌","餐桌很旧了，上面有不少再爱干净也擦不掉的污渍。抽屉里有一双木质筷子，一双一次性筷子，上面刻有“湘味”的字迹。"),
    ("客厅-床铺","床上的被子已经被掀开，堆在一边。床单很旧，有不少补丁，但很干净。枕头上有两个人躺过的痕迹。枕头下有一个小盒子。"),
    ("灶台-燃气灶","有长时间开过火的痕迹，燃气灶老旧，燃气喷嘴处有异物堵塞。"),
    ("灶台-垃圾桶","垃圾桶空空如也，没有袋子。"),
    ("洗手间-窗户","被百叶窗盖住的窗户关闭，被人上了锁。"),
    ("储物柜-药盒","透明药盒里有两瓶一样的感冒药，其中一瓶打开过，另一瓶还未拆封。"),
    ("门口-备忘录","温心的日程表，贴在门边的墙上。纸上的字迹用力，不好看，却很整齐。便签纸有些陈旧，边缘发黄，看起来已经用了很久。"),
]

default persistent.clue = [0]*len(clueList)
# images for clues
image evlocked = "gui/ev/ev-locked.png"
image clue0 = "images/clue/clue_0.png"
image clue1 = "images/clue/clue_1.png"
image clue2 = "images/clue/clue_2.png"
image clue3 = "images/clue/clue_3.png"
image clue4 = "images/clue/clue_4.png"
image clue5 = "images/clue/clue_5.png"
image clue6 = "images/clue/clue_6.png"
image clue7 = "images/clue/clue_7.webp"


# character info
define charList = [
    "白一",
    "岑宣",
    "繁锦",
    "梁绵绵",
    "林望龙",
    "姒舞",
    "天玉",
    "卫锋",
    "温心",
    "西平",
    "西顺",
    "张班",
]

define charBasic = [
    ["女性 17岁","高二6班 普通班"],
    ["女性 17岁","高二9班 精英班"],
    ["女性 25岁","心理辅导教师"],
    ["女性 15岁","高二8班 特长班"],
    ["男性 16岁","高二9班 精英班"],
    ["女性 17岁","高二7班 特长班"],
    ["女性 16岁","高二6班 普通班"],
    ["女性 17岁","高二6班 普通班"],
    ["女性 17岁","高二6班 普通班"],
    ["女性 26岁","城安局 编外人员"],
    ["女性 24岁","城安局 特调组"],
    ["女性 26岁","高二6班 班主任"],
]

define charInfoContent= [
    ["没存在感，讨厌麻烦","经常被说“看起来很阴沉”","其实话很多，尤其是骂人的话，只是一般不会说出来"],
    ["成绩优良，每个科目都发展均衡","好胜心很强，也喜欢挑战自己","在乎人际关系，在乎自己的形象，在乎他人看法"],
    ["善良，温和，有时有些啰嗦","乐于助人，总是希望自己能够帮助到别人","曾在社区中心担任心理咨询师，后转到学校工作"],
    ["正在退步的体育生","总是很有活力，带着笑容","在乎朋友，在乎喜欢的人"],
    ["超前学习了很多，但效果并不算理想","认为自己和其他同学是不同的","被家人寄予厚望，目标只有第一名"],
    ["社交天才（自称）","不爱学习，特别喜欢八卦","某些情况下，有动物般的精准直觉"],
    ["在普通班保持成绩年级前5的优秀学生","性格好，人缘好，八面玲珑","家里很有钱，已经有不少个人资产"],
    ["高二6班的班长，成绩中上","有很强的正义感和责任感","做事容易较真，有些古板固执"],
    ["父母双亡，由奶奶抚养长大","努力学习，希望带奶奶过上好的生活","奶奶去世后，目标变成了让奶奶入土为安"],
    ["特聘编外人员，兼任法医和西顺的保镖","高智商，跳级上学毕业","作为姐姐，经常在生活上被妹妹照顾"],
    ["体质罕见，极其容易吸引怪异","外表温柔而和善，擅长和人拉近关系","怕死，工作是为了让自己更好活着"],
    ["教龄5年，第一次当班主任","没有任何热情，得过且过","多次后悔选择这个教师职业"],
]

default persistent.charhex = [0]*len(charList)
default persistent.charinfo1 = [0]*len(charList)
default persistent.charinfo2 = [0]*len(charList)
default persistent.charinfo3 = [0]*len(charList)

# story noun explanation
default persistent.dictList = [
]